{"<PAD>": 0, "<UNK>": 1, "i": 2, "have": 3, "no": 4, "idea": 5, "what's": 6, "happening": 7, "in": 8, "this": 9, "sql": 10, "joins": 11, "problem": 12, "i'm": 13, "curious": 14, "what": 15, "other": 16, "techniques": 17, "exist": 18, "beyond": 19, "database": 20, "design": 21, "solved": 22, "the": 23, "data": 24, "structures": 25, "set": 26, "without": 27, "any": 28, "help": 29, "feeling": 30, "confident": 31, "i've": 32, "tried": 33, "solving": 34, "pointers": 35, "c": 36, "for": 37, "hours": 38, "and": 39, "nothing": 40, "works": 41, "so": 42, "frustrated": 43, "feel": 44, "strong": 45, "capable": 46, "when": 47, "it": 48, "comes": 49, "to": 50, "coding": 51, "assignment": 52, "now": 53, "studying": 54, "physics": 55, "mechanics": 56, "today": 57, "feels": 58, "like": 59, "a": 60, "chore": 61, "just": 62, "going": 63, "through": 64, "motions": 65, "exhausted": 66, "irritated": 67, "trying": 68, "debug": 69, "english": 70, "essays": 71, "issue": 72, "nailed": 73, "practice": 74, "problems": 75, "on": 76, "calculus": 77, "derivatives": 78, "great": 79, "about": 80, "keep": 81, "thinking": 82, "different": 83, "ways": 84, "apply": 85, "it's": 86, "exciting": 87, "explore": 88, "can": 89, "you": 90, "tell": 91, "me": 92, "more": 93, "why": 94, "machine": 95, "learning": 96, "models": 97, "behaves": 98, "way": 99, "completely": 100, "lost": 101, "api": 102, "integration": 103, "none": 104, "of": 105, "steps": 106, "make": 107, "sense": 108, "music": 109, "theory": 110, "object": 111, "oriented": 112, "programming": 113, "happens": 114, "if": 115, "we": 116, "change": 117, "approach": 118, "linear": 119, "algebra": 120, "want": 121, "experiment": 122, "interest": 123, "same": 124, "thing": 125, "over": 126, "getting": 127, "stuck": 128, "not": 129, "sure": 130, "where": 131, "went": 132, "wrong": 133, "does": 134, "lab": 135, "report": 136, "breaking": 137, "matter": 138, "try": 139, "is": 140, "infuriating": 141, "don't": 142, "understand": 143, "how": 144, "someone": 145, "explain": 146, "differently": 147, "aced": 148, "quiz": 149, "organic": 150, "chemistry": 151, "really": 152, "know": 153, "material": 154, "well": 155, "wonder": 156, "actually": 157, "behind": 158, "scenes": 159, "fascinating": 160, "honestly": 161, "monotonous": 162, "zero": 163, "motivation": 164, "continue": 165, "french": 166, "grammar": 167, "prepared": 168, "everything": 169, "clicked": 170, "into": 171, "place": 172, "finally": 173, "binary": 174, "trees": 175, "ready": 176, "exam": 177, "economics": 178, "graphs": 179, "excites": 180, "right": 181, "close": 182, "book": 183, "handle": 184, "question": 185, "test": 186, "tomorrow": 187, "intrigued": 188, "by": 189, "dig": 190, "details": 191, "probability": 192, "after": 193, "practicing": 194, "makes": 195, "total": 196, "others": 197, "tired": 198, "repetitive": 199, "dull": 200, "every": 201, "time": 202, "end": 203, "up": 204, "confused": 205, "than": 206, "before": 207, "read": 208, "chapter": 209, "five": 210, "times": 211, "interesting": 212, "anymore": 213, "explanation": 214, "textbook": 215, "confusing": 216, "even": 217, "stressed": 218, "out": 219, "giving": 220, "annoyed": 221, "with": 222, "neural": 223, "networks": 224, "attempt": 225, "fails": 226, "zoning": 227, "whenever": 228, "talk": 229, "class": 230, "i'd": 231, "love": 232, "web": 233, "development": 234, "deeply": 235, "there's": 236, "much": 237, "learn": 238, "thermodynamics": 239, "recursion": 240, "statistics": 241, "group": 242, "presentation": 243, "mixing": 244, "all": 245, "concepts": 246, "overwhelming": 247, "gradient": 248, "descent": 249, "screaming": 250, "cell": 251, "biology": 252, "won't": 253, "work": 254, "do": 255, "driving": 256, "crazy": 257, "hitting": 258, "errors": 259, "my": 260, "research": 261, "project": 262, "new": 263, "further": 264, "can't": 265, "follow": 266, "logic": 267, "doesn't": 268, "click": 269, "python": 270, "loops": 271, "lecture": 272, "dragging": 273, "focus": 274, "at": 275, "limit": 276, "seems": 277, "algorithms": 278}